Revit 2027 API
BuiltInFailures.DividedPathFailures.DividedPathCannotCreateFromGeometry Property
 Highlighted geometry contains a path or edge that could not be divided.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedPathCannotCreateFromGeometry { get; }
Public Shared ReadOnly Property DividedPathCannotCreateFromGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedPathCannotCreateFromGeometry {
	FailureDefinitionId^ get ();
}
static member DividedPathCannotCreateFromGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedPathFailures Class
Autodesk.Revit.DB Namespace